## Pandas 
is a powerful data manipulation library in python widely used for data analysis and data cleaning. It provides two primary data structur: series and DataFrames. a series is a one dimensionl array like object while a dataframe is two dimensional size mutable and potentially heterogeneous tabular data structure with labeled axes (rows and columns)

In [32]:
import pandas as pd

In [33]:
#series
#pandas series is a one dimensional array similer to a column in a table

s = pd.Series([1,2,3,4,5])
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [34]:
#create a series from dioctionary

d = {'a':1,'b':2,'c':3,'d':4,'e':5}

s = pd.Series(d)
print(s)
print(type(s))

a    1
b    2
c    3
d    4
e    5
dtype: int64
<class 'pandas.core.series.Series'>

In [35]:
data= [1,2,3,4,5]
index= ['a','b','c','d','e']

s = pd.Series(data,index=index)
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [36]:
##dataframe
#2D data structure
#create a dataframe from dictionary

data={
    "Name":['jiger','kunjesh','gulshan'],
    "Age": [22,33,44],
    "City": ['Delhi','Mumbai','Chennai']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0    jiger   22    Delhi
1  kunjesh   33   Mumbai
2  gulshan   44  Chennai
<class 'pandas.core.frame.DataFrame'>

In [37]:
import numpy as np
np.array(df)

array([['jiger', 22, 'Delhi'],
       ['kunjesh', 33, 'Mumbai'],
       ['gulshan', 44, 'Chennai']], dtype=object)

In [38]:
#create a dataframe from list of dictionary

data = [
    {'Name':'jiger','Age':22,'City':'Delhi'},
    {'Name':'kunjesh','Age':33,'City':'Mumbai'},
    {'Name':'gulshan','Age':44,'City':'Chennai'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0    jiger   22    Delhi
1  kunjesh   33   Mumbai
2  gulshan   44  Chennai
<class 'pandas.core.frame.DataFrame'>

In [39]:
#read csv file
# df=pd.read_csv('insurance_data.csv')
# print(df.head(5))

In [41]:
##accessing data from dataframe

df

      Name  Age     City
0    jiger   22    Delhi
1  kunjesh   33   Mumbai
2  gulshan   44  Chennai

In [43]:
#when i pick up a colums is called series
type(df['Name'])

pandas.core.series.Series

In [49]:
df.loc[0][0]#accessing row

C:\Users\gurah\AppData\Local\Temp\ipykernel_8420\3893883026.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]#accessing row

'jiger'

In [50]:
df.iloc[0][0]#

C:\Users\gurah\AppData\Local\Temp\ipykernel_8420\2865547715.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]#

'jiger'

In [51]:
##accessing a specified element
df['Name']

0      jiger
1    kunjesh
2    gulshan
Name: Name, dtype: object

In [55]:
print(df.at[0,'Name'])
print(df.at[1,'Name'])
print(df.at[2,'Name'])

jiger
kunjesh
gulshan

In [59]:
#Accesing a specific element using iat

print(df.iat[0,0])
print(df.iat[2,0])
print(df.iat[2,2])

jiger
gulshan
Chennai

In [60]:
df

      Name  Age     City
0    jiger   22    Delhi
1  kunjesh   33   Mumbai
2  gulshan   44  Chennai

In [63]:
#data manipulation with dataframe
#add new column
df['Salary']=[1000,2000,3000]
df

      Name  Age     City  Salary
0    jiger   22    Delhi    1000
1  kunjesh   33   Mumbai    2000
2  gulshan   44  Chennai    3000

In [70]:
#rename columns
df.drop('Salary',axis=1,inplace=True)

In [71]:
df

      Name  Age     City
0    jiger   22    Delhi
1  kunjesh   33   Mumbai
2  gulshan   44  Chennai

In [74]:
#add age to the column
df['Age']=df['Age']+1
df

      Name  Age     City
0    jiger   25    Delhi
1  kunjesh   36   Mumbai
2  gulshan   47  Chennai

In [77]:
df.drop(0,inplace=True)

In [78]:
df

      Name  Age     City
1  kunjesh   36   Mumbai
2  gulshan   47  Chennai

In [79]:
#display the data types of each column
print("Data Ypes:\n",df.dtypes)
#describe the dataframe
print("Describe:\n",df.describe())
#group by a column and perform an aggregation
group= df.groupby('City')
print("Group:\n",group)

Data Ypes:
 Name    object
Age      int64
City    object
dtype: object
Describe:
              Age
count   2.000000
mean   41.500000
std     7.778175
min    36.000000
25%    38.750000
50%    41.500000
75%    44.250000
max    47.000000
Group:
 <pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000215DF3E9D00>